src/test/java/com/mercadopago/resources/mocks/response/authorizedpayment/authorizedpayment_base.json

{
  "preapproval_id": "2c9381847e1d0a2g018e5dd3d21b2c6b",
  "id": 7008600935,
  "type": "recurring",
  "status": "processed",
  "date_created": "2022-01-10T10:10:10.000-00:00",
  "last_modified": "2022-01-10T10:10:10.000-00:00",
  "transaction_amount": 1000,
  "currency_id": "ARS",
  "reason": "Reason",
  "external_reference": "1",
  "payment": {
    "id": 74478215675,
    "status": "approved",
    "status_detail": "accredited"
  },
  "retry_attempt": 1,
  "next_retry_date": "2022-01-10T10:10:10.000-00:00",
  "debit_date": "2022-01-10T10:10:10.000-00:00",
  "payment_method_id": "card"
}